// 1. 인자의 전달은 stack을 이용한다.
//   => Calling Convention
//    1) cdecl   => caller가 인자 스택을 정리한다.
//     2) stdcall => callee가 인자 스택을 정리한다.
//     3) fastcall  => 레지스터 내 하나 이상의 인자를 통과시키며 호출에 필요한 메모리 접근의 수를 줄인다.(메모리 스택을 사용하지 않고 레지스터를 사용한다.)
//     —————
//     4) 64bit call
//     => 인자의 전달을 레지스터를 이용해서 전달한다.

// 2. 함수 호출 이전의 상태와 함수 호출 후의 스택 상태는
//    동일해야 한다.
//    foo(10, 20);
//       push 20
//       push 10
//    인자 스택을 정리한다.

// 3. 가변 인자는 스택을 통해 인자가 전달된다.
//   : 가변 인자를 통해 호출된 함수는, 몇 개의 인자가 자신에게
//     전달되었는지 알 수 없다. (=> Caller가 인자 스택을 정리한다)
//     C 언어에서는 고정 인자를 통해 몇 개의 인자가 전달되었는지
//     알려야한다.


int sum(int n, …) {

    return 42;
}

int main() {
    // printf("%d %d %d", 10, 20, 30);
}
